<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"f305a4311b3a02d748f40444b4628ec855af1e39e7d39de42253536e5c96593b","plan_job_ref":"Job Test actions using target and replace #452 at https://github.com/dflook/terraform-github-actions/actions/runs/12934968354","plan_out_hash":"d9bd91205a3c4b63b0dc654ad6ca752731a29e83c8d15f64472900e880530ee9","plan_hash":"5bde5db26d1f37a2839cf4b29223ebf9afaa837fedd8ba942f61665ad87a8a61","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "w4vSRk6L4b" -> (known after apply)
!~  foreach = "OIVpAeStuX" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #452](https://github.com/dflook/terraform-github-actions/actions/runs/12934968354)